OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
extern __at(0x001E) volatile __T0CON0bits_t T0CON0bits;

#define _T0OUTPS0               0x01
#define _T0OUTPS1               0x02
#define _T0OUTPS2               0x04
#define _T0OUTPS3               0x08
#define _T016BIT                0x10
#define _T0OUT                  0x20
#define _T0EN                   0x80

//==============================================================================


//==============================================================================
//        T0CON1 Bits

extern __at(0x001F) __sfr T0CON1;

typedef union
  {
  struct
    {
    unsigned T0CKPS0            : 1;
    unsigned T0CKPS1            : 1;
    unsigned T0CKPS2            : 1;
    unsigned T0CKPS3            : 1;
    unsigned T0ASYNC            : 1;
    unsigned T0CS0              : 1;
    unsigned T0CS1              : 1;
    unsigned T0CS2              : 1;
    };

  struct
    {
    unsigned T0PS0              : 1;
    unsigned T0PS1              : 1;
    unsigned T0PS2              : 1;
    unsigned T0PS3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T0CKPS             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned T0PS               : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 5;
    unsigned T0CS               : 3;
    };
  } __T0CON1bits_t;

extern __at(0x001F) volatile __T0CON1bits_t T0CON1bits;

#define _T0CKPS0                0x01
#define _T0PS0                  0x01
#define _T0CKPS1                0x02
#define _T0PS1                  0x02
#define _T0CKPS2                0x04
#define _T0PS2                  0x04
#define _T0CKPS3                0x08
#define _T0PS3                  0x08
#define _T0ASYNC                0x10
#define _T0CS0                  0x20
#define _T0CS1                  0x40
#define _T0CS2                  0x80

//==============================================================================

extern __at(0x008C) __sfr ADRES;
extern __at(0x008C) __sfr ADRESL;
extern __at(0x008D) __sfr ADRESH;
extern __at(0x008E) __sfr ADPREV;

//==============================================================================
//        ADPREVL Bits

extern __at(0x008E) __sfr ADPREVL;

typedef struct
  {
  unsigned ADPREV0              : 1;
  unsigned ADPREV1              : 1;
  unsigned ADPREV2              : 1;
  unsigned ADPREV3              : 1;
  unsigned ADPREV4              : 1;
  unsigned ADPREV5              : 1;
  unsigned ADPREV6              : 1;
  unsigned ADPREV7              : 1;
  } __ADPREVLbits_t;

extern __at(0x008E) volatile __ADPREVLbits_t ADPREVLbits;

#define _ADPREV0                0x01
#define _ADPREV1                0x02
#define _ADPREV2                0x04
#define _ADPREV3                0x08
#define _ADPREV4                0x10
#define _ADPREV5                0x20
#define _ADPREV6                0x40
#define _ADPREV7                0x80

//==============================================================================


//==============================================================================
//        ADPREVH Bits

extern __at(0x008F) __sfr ADPREVH;

typedef struct
  {
  unsigned ADPREV8              : 1;
  unsigned ADPREV9              : 1;
  unsigned ADPREV10             : 1;
  unsigned ADPREV11             : 1;
  unsigned ADPREV12             : 1;
  unsigned ADPREV13             : 1;
  unsigned ADPREV14             : 1;
  unsigned ADPREV15             : 1;
  } __ADPREVHbits_t;

extern __at(0x008F) volatile __ADPREVHbits_t ADPREVHbits;

#define _ADPREV8                0x01
#define _ADPREV9                0x02
#define _ADPREV10               0x04
#define _ADPREV11               0x08
#define _ADPREV12               0x10
#define _ADPREV13               0x20
#define _ADPREV14               0x40
#define _ADPREV15               0x80

//==============================================================================

extern __at(0x0090) __sfr ADACC;

//==============================================================================
//        ADACCL Bits

extern __at(0x0090) __sfr ADACCL;

typedef struct
  {
  unsigned ADACC0               : 1;
  unsigned ADACC1               : 1;
  unsigned ADACC2               : 1;
  unsigned ADACC3               : 1;
  unsigned ADACC4               : 1;
  unsigned ADACC5               : 1;
  unsigned ADACC6               : 1;
  unsigned ADACC7               : 1;
  } __ADACCLbits_t;

extern __at(0x0090) volatile __ADACCLbits_t ADACCLbits;

#define _ADACC0                 0x01
#define _ADACC1                 0x02
#define _ADACC2                 0x04
#define _ADACC3                 0x08
#define _ADACC4                 0x10
#define _ADACC5                 0x20
#define _ADACC6                 0x40
#define _ADACC7                 0x80

//==============================================================================


//==============================================================================
//        ADACCH Bits

extern __at(0x0091) __sfr ADACCH;

typedef struct
  {
  unsigned ADACC8               : 1;
  unsigned ADACC9               : 1;
  unsigned ADACC10              : 1;
  unsigned ADACC11              : 1;
  unsigned ADACC12              : 1;
  unsigned ADACC13              : 1;
  unsigned ADACC14              : 1;
  unsigned ADACC15              : 1;
  } __ADACCHbits_t;

extern __at(0x0091) volatile __ADACCHbits_t ADACCHbits;

#define _ADACC8                 0x01
#define _ADACC9                 0x02
#define _ADACC10                0x04
#define _ADACC11                0x08
#define _ADACC12                0x10
#define _ADACC13                0x20
#define _ADACC14                0x40
#define _ADACC15                0x80

//==============================================================================


//==============================================================================
//        ADCON0 Bits

extern __at(0x0093) __sfr ADCON0;

typedef union
  {
  struct
    {
    unsigned ADGO               : 1;
    unsigned                    : 1;
    unsigned ADFM0              : 1;
    unsigned ADFM1              : 1;
    unsigned ADCS               : 1;
    unsigned                    : 1;
    unsigned ADCONT             : 1;
    unsigned ADON               : 1;
    };

  struct
    {
    unsigned DONE               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned NOT_DONE           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GO                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GO_NOT_DONE        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 2;
    unsigned ADFM               : 2;
    unsigned                    : 4;
    };
  } __ADCON0bits_t;

extern __at(0x0093) volatile __ADCON0bits_t ADCON0bits;

#define _ADGO                   0x01
#define _DONE                   0x01
#define _NOT_DONE               0x01
#define _GO                     0x01
#define _GO_NOT_DONE            0x01
#define _ADFM0                  0x04
#define _ADFM1                  0x08
#define _ADCS                   0x10
#define _ADCONT                 0x40
#define _ADON                   0x80

//==============================================================================


//==============================================================================
//        ADCON1 Bits

extern __at(0x0094) __sfr ADCON1;

typedef struct
  {
  unsigned ADDSEN               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned ADGPOL               : 1;
  unsigned ADIPEN               : 1;
  unsigned ADPPOL               : 1;
  } __ADCON1bits_t;

