OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
extern __at(0x0094) volatile __ADCON1bits_t ADCON1bits;

#define _ADDSEN                 0x01
#define _ADGPOL                 0x20
#define _ADIPEN                 0x40
#define _ADPPOL                 0x80

//==============================================================================


//==============================================================================
//        ADCON2 Bits

extern __at(0x0095) __sfr ADCON2;

typedef union
  {
  struct
    {
    unsigned ADMD0              : 1;
    unsigned ADMD1              : 1;
    unsigned ADMD2              : 1;
    unsigned ADACLR             : 1;
    unsigned ADCRS0             : 1;
    unsigned ADCRS1             : 1;
    unsigned ADCRS2             : 1;
    unsigned ADPSIS             : 1;
    };

  struct
    {
    unsigned ADMD               : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCRS              : 3;
    unsigned                    : 1;
    };
  } __ADCON2bits_t;

extern __at(0x0095) volatile __ADCON2bits_t ADCON2bits;

#define _ADMD0                  0x01
#define _ADMD1                  0x02
#define _ADMD2                  0x04
#define _ADACLR                 0x08
#define _ADCRS0                 0x10
#define _ADCRS1                 0x20
#define _ADCRS2                 0x40
#define _ADPSIS                 0x80

//==============================================================================


//==============================================================================
//        ADCON3 Bits

extern __at(0x0096) __sfr ADCON3;

typedef union
  {
  struct
    {
    unsigned ADTMD0             : 1;
    unsigned ADTMD1             : 1;
    unsigned ADTMD2             : 1;
    unsigned ADSOI              : 1;
    unsigned ADCALC0            : 1;
    unsigned ADCALC1            : 1;
    unsigned ADCALC2            : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADTMD              : 3;
    unsigned                    : 5;
    };

  struct
    {
    unsigned                    : 4;
    unsigned ADCALC             : 3;
    unsigned                    : 1;
    };
  } __ADCON3bits_t;

extern __at(0x0096) volatile __ADCON3bits_t ADCON3bits;

#define _ADTMD0                 0x01
#define _ADTMD1                 0x02
#define _ADTMD2                 0x04
#define _ADSOI                  0x08
#define _ADCALC0                0x10
#define _ADCALC1                0x20
#define _ADCALC2                0x40

//==============================================================================


//==============================================================================
//        ADSTAT Bits

extern __at(0x0097) __sfr ADSTAT;

typedef union
  {
  struct
    {
    unsigned ADSTAT0            : 1;
    unsigned ADSTAT1            : 1;
    unsigned ADSTAT2            : 1;
    unsigned ADMACT             : 1;
    unsigned ADMATH             : 1;
    unsigned ADLTHR             : 1;
    unsigned ADUTHR             : 1;
    unsigned ADAOV              : 1;
    };

  struct
    {
    unsigned ADSTAT             : 3;
    unsigned                    : 5;
    };
  } __ADSTATbits_t;

extern __at(0x0097) volatile __ADSTATbits_t ADSTATbits;

#define _ADSTAT0                0x01
#define _ADSTAT1                0x02
#define _ADSTAT2                0x04
#define _ADMACT                 0x08
#define _ADMATH                 0x10
#define _ADLTHR                 0x20
#define _ADUTHR                 0x40
#define _ADAOV                  0x80

//==============================================================================


//==============================================================================
//        ADCLK Bits

extern __at(0x0098) __sfr ADCLK;

typedef union
  {
  struct
    {
    unsigned ADCCS0             : 1;
    unsigned ADCCS1             : 1;
    unsigned ADCCS2             : 1;
    unsigned ADCCS3             : 1;
    unsigned ADCCS4             : 1;
    unsigned ADCCS5             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADCCS              : 6;
    unsigned                    : 2;
    };
  } __ADCLKbits_t;

extern __at(0x0098) volatile __ADCLKbits_t ADCLKbits;

#define _ADCCS0                 0x01
#define _ADCCS1                 0x02
#define _ADCCS2                 0x04
#define _ADCCS3                 0x08
#define _ADCCS4                 0x10
#define _ADCCS5                 0x20

//==============================================================================


//==============================================================================
//        ADACT Bits

extern __at(0x0099) __sfr ADACT;

typedef union
  {
  struct
    {
    unsigned ADACT0             : 1;
    unsigned ADACT1             : 1;
    unsigned ADACT2             : 1;
    unsigned ADACT3             : 1;
    unsigned ADACT4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADACT              : 5;
    unsigned                    : 3;
    };
  } __ADACTbits_t;

extern __at(0x0099) volatile __ADACTbits_t ADACTbits;

#define _ADACT0                 0x01
#define _ADACT1                 0x02
#define _ADACT2                 0x04
#define _ADACT3                 0x08
#define _ADACT4                 0x10

//==============================================================================


//==============================================================================
//        ADREF Bits

extern __at(0x009A) __sfr ADREF;

typedef union
  {
  struct
    {
    unsigned ADPREF0            : 1;
    unsigned ADPREF1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned ADNREF             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ADPREF             : 2;
    unsigned                    : 6;
    };
  } __ADREFbits_t;

extern __at(0x009A) volatile __ADREFbits_t ADREFbits;

