OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
extern __at(0x019C) __sfr SSP2CON3;

typedef struct
  {
  unsigned DHEN                 : 1;
  unsigned AHEN                 : 1;
  unsigned SBCDE                : 1;
  unsigned SDAHT                : 1;
  unsigned BOEN                 : 1;
  unsigned SCIE                 : 1;
  unsigned PCIE                 : 1;
  unsigned ACKTIM               : 1;
  } __SSP2CON3bits_t;

extern __at(0x019C) volatile __SSP2CON3bits_t SSP2CON3bits;

#define _SSP2CON3_DHEN          0x01
#define _SSP2CON3_AHEN          0x02
#define _SSP2CON3_SBCDE         0x04
#define _SSP2CON3_SDAHT         0x08
#define _SSP2CON3_BOEN          0x10
#define _SSP2CON3_SCIE          0x20
#define _SSP2CON3_PCIE          0x40
#define _SSP2CON3_ACKTIM        0x80

//==============================================================================


//==============================================================================
//        TMR1L Bits

extern __at(0x020C) __sfr TMR1L;

typedef struct
  {
  unsigned TMR1L0               : 1;
  unsigned TMR1L1               : 1;
  unsigned TMR1L2               : 1;
  unsigned TMR1L3               : 1;
  unsigned TMR1L4               : 1;
  unsigned TMR1L5               : 1;
  unsigned TMR1L6               : 1;
  unsigned TMR1L7               : 1;
  } __TMR1Lbits_t;

extern __at(0x020C) volatile __TMR1Lbits_t TMR1Lbits;

#define _TMR1L0                 0x01
#define _TMR1L1                 0x02
#define _TMR1L2                 0x04
#define _TMR1L3                 0x08
#define _TMR1L4                 0x10
#define _TMR1L5                 0x20
#define _TMR1L6                 0x40
#define _TMR1L7                 0x80

//==============================================================================


//==============================================================================
//        TMR1H Bits

extern __at(0x020D) __sfr TMR1H;

typedef struct
  {
  unsigned TMR1H0               : 1;
  unsigned TMR1H1               : 1;
  unsigned TMR1H2               : 1;
  unsigned TMR1H3               : 1;
  unsigned TMR1H4               : 1;
  unsigned TMR1H5               : 1;
  unsigned TMR1H6               : 1;
  unsigned TMR1H7               : 1;
  } __TMR1Hbits_t;

extern __at(0x020D) volatile __TMR1Hbits_t TMR1Hbits;

#define _TMR1H0                 0x01
#define _TMR1H1                 0x02
#define _TMR1H2                 0x04
#define _TMR1H3                 0x08
#define _TMR1H4                 0x10
#define _TMR1H5                 0x20
#define _TMR1H6                 0x40
#define _TMR1H7                 0x80

//==============================================================================


//==============================================================================
//        T1CON Bits

extern __at(0x020E) __sfr T1CON;

typedef union
  {
  struct
    {
    unsigned ON                 : 1;
    unsigned RD16               : 1;
    unsigned NOT_SYNC           : 1;
    unsigned                    : 1;
    unsigned T1CKPS0            : 1;
    unsigned T1CKPS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TMR1ON             : 1;
    unsigned T1RD16             : 1;
    unsigned NOT_T1SYNC         : 1;
    unsigned                    : 1;
    unsigned CKPS0              : 1;
    unsigned CKPS1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T1CKPS             : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CKPS               : 2;
    unsigned                    : 2;
    };
  } __T1CONbits_t;

extern __at(0x020E) volatile __T1CONbits_t T1CONbits;

#define _T1CON_ON               0x01
#define _T1CON_TMR1ON           0x01
#define _T1CON_RD16             0x02
#define _T1CON_T1RD16           0x02
#define _T1CON_NOT_SYNC         0x04
#define _T1CON_NOT_T1SYNC       0x04
#define _T1CON_T1CKPS0          0x10
#define _T1CON_CKPS0            0x10
#define _T1CON_T1CKPS1          0x20
#define _T1CON_CKPS1            0x20

//==============================================================================


//==============================================================================
//        PR1 Bits

extern __at(0x020F) __sfr PR1;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1GVAL             : 1;
    unsigned T1GGO_NOT_DONE     : 1;
    unsigned T1GSPM             : 1;
    unsigned T1GTM              : 1;
    unsigned T1GPOL             : 1;
    unsigned T1GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PR1bits_t;

extern __at(0x020F) volatile __PR1bits_t PR1bits;

#define _GVAL                   0x04
#define _T1GVAL                 0x04
#define _GGO_NOT_DONE           0x08
#define _T1GGO_NOT_DONE         0x08
#define _T1GGO                  0x08
#define _GSPM                   0x10
#define _T1GSPM                 0x10
#define _GTM                    0x20
#define _T1GTM                  0x20
#define _GPOL                   0x40
#define _T1GPOL                 0x40
#define _GE                     0x80
#define _T1GE                   0x80

//==============================================================================


//==============================================================================
//        T1GCON Bits

extern __at(0x020F) __sfr T1GCON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1GVAL             : 1;
    unsigned T1GGO_NOT_DONE     : 1;
    unsigned T1GSPM             : 1;
    unsigned T1GTM              : 1;
    unsigned T1GPOL             : 1;
    unsigned T1GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T1GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __T1GCONbits_t;

extern __at(0x020F) volatile __T1GCONbits_t T1GCONbits;

