OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define _TMR1CLK_T1CS0          0x01
#define _TMR1CLK_CS0            0x01
#define _TMR1CLK_T1CS1          0x02
#define _TMR1CLK_CS1            0x02
#define _TMR1CLK_T1CS2          0x04
#define _TMR1CLK_CS2            0x04
#define _TMR1CLK_T1CS3          0x08
#define _TMR1CLK_CS3            0x08

//==============================================================================


//==============================================================================
//        TMR3L Bits

extern __at(0x0212) __sfr TMR3L;

typedef struct
  {
  unsigned TMR3L0               : 1;
  unsigned TMR3L1               : 1;
  unsigned TMR3L2               : 1;
  unsigned TMR3L3               : 1;
  unsigned TMR3L4               : 1;
  unsigned TMR3L5               : 1;
  unsigned TMR3L6               : 1;
  unsigned TMR3L7               : 1;
  } __TMR3Lbits_t;

extern __at(0x0212) volatile __TMR3Lbits_t TMR3Lbits;

#define _TMR3L0                 0x01
#define _TMR3L1                 0x02
#define _TMR3L2                 0x04
#define _TMR3L3                 0x08
#define _TMR3L4                 0x10
#define _TMR3L5                 0x20
#define _TMR3L6                 0x40
#define _TMR3L7                 0x80

//==============================================================================


//==============================================================================
//        TMR3H Bits

extern __at(0x0213) __sfr TMR3H;

typedef struct
  {
  unsigned TMR3H0               : 1;
  unsigned TMR3H1               : 1;
  unsigned TMR3H2               : 1;
  unsigned TMR3H3               : 1;
  unsigned TMR3H4               : 1;
  unsigned TMR3H5               : 1;
  unsigned TMR3H6               : 1;
  unsigned TMR3H7               : 1;
  } __TMR3Hbits_t;

extern __at(0x0213) volatile __TMR3Hbits_t TMR3Hbits;

#define _TMR3H0                 0x01
#define _TMR3H1                 0x02
#define _TMR3H2                 0x04
#define _TMR3H3                 0x08
#define _TMR3H4                 0x10
#define _TMR3H5                 0x20
#define _TMR3H6                 0x40
#define _TMR3H7                 0x80

//==============================================================================


//==============================================================================
//        T3CON Bits

extern __at(0x0214) __sfr T3CON;

typedef union
  {
  struct
    {
    unsigned ON                 : 1;
    unsigned RD16               : 1;
    unsigned NOT_SYNC           : 1;
    unsigned                    : 1;
    unsigned T3CKPS0            : 1;
    unsigned T3CKPS1            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned TMR3ON             : 1;
    unsigned T3RD16             : 1;
    unsigned NOT_T3SYNC         : 1;
    unsigned                    : 1;
    unsigned CKPS0              : 1;
    unsigned CKPS1              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 4;
    unsigned CKPS               : 2;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 4;
    unsigned T3CKPS             : 2;
    unsigned                    : 2;
    };
  } __T3CONbits_t;

extern __at(0x0214) volatile __T3CONbits_t T3CONbits;

#define _T3CON_ON               0x01
#define _T3CON_TMR3ON           0x01
#define _T3CON_RD16             0x02
#define _T3CON_T3RD16           0x02
#define _T3CON_NOT_SYNC         0x04
#define _T3CON_NOT_T3SYNC       0x04
#define _T3CON_T3CKPS0          0x10
#define _T3CON_CKPS0            0x10
#define _T3CON_T3CKPS1          0x20
#define _T3CON_CKPS1            0x20

//==============================================================================


//==============================================================================
//        PR3 Bits

extern __at(0x0215) __sfr PR3;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3GVAL             : 1;
    unsigned T3GGO_NOT_DONE     : 1;
    unsigned T3GSPM             : 1;
    unsigned T3GTM              : 1;
    unsigned T3GPOL             : 1;
    unsigned T3GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PR3bits_t;

extern __at(0x0215) volatile __PR3bits_t PR3bits;

#define _PR3_GVAL               0x04
#define _PR3_T3GVAL             0x04
#define _PR3_GGO_NOT_DONE       0x08
#define _PR3_T3GGO_NOT_DONE     0x08
#define _PR3_T3GGO              0x08
#define _PR3_GSPM               0x10
#define _PR3_T3GSPM             0x10
#define _PR3_GTM                0x20
#define _PR3_T3GTM              0x20
#define _PR3_GPOL               0x40
#define _PR3_T3GPOL             0x40
#define _PR3_GE                 0x80
#define _PR3_T3GE               0x80

//==============================================================================


//==============================================================================
//        T3GCON Bits

extern __at(0x0215) __sfr T3GCON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned GVAL               : 1;
    unsigned GGO_NOT_DONE       : 1;
    unsigned GSPM               : 1;
    unsigned GTM                : 1;
    unsigned GPOL               : 1;
    unsigned GE                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3GVAL             : 1;
    unsigned T3GGO_NOT_DONE     : 1;
    unsigned T3GSPM             : 1;
    unsigned T3GTM              : 1;
    unsigned T3GPOL             : 1;
    unsigned T3GE               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned T3GGO              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __T3GCONbits_t;

extern __at(0x0215) volatile __T3GCONbits_t T3GCONbits;

#define _T3GCON_GVAL            0x04
#define _T3GCON_T3GVAL          0x04
#define _T3GCON_GGO_NOT_DONE    0x08
#define _T3GCON_T3GGO_NOT_DONE  0x08
#define _T3GCON_T3GGO           0x08
#define _T3GCON_GSPM            0x10
#define _T3GCON_T3GSPM          0x10
#define _T3GCON_GTM             0x20
#define _T3GCON_T3GTM           0x20
#define _T3GCON_GPOL            0x40
#define _T3GCON_T3GPOL          0x40
#define _T3GCON_GE              0x80
#define _T3GCON_T3GE            0x80

//==============================================================================


//==============================================================================
//        T3GATE Bits

extern __at(0x0216) __sfr T3GATE;

typedef union
  {
  struct
    {
    unsigned GSS0               : 1;
    unsigned GSS1               : 1;
    unsigned GSS2               : 1;
    unsigned GSS3               : 1;
    unsigned GSS4               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T3GSS0             : 1;
    unsigned T3GSS1             : 1;
    unsigned T3GSS2             : 1;
    unsigned T3GSS3             : 1;
    unsigned T3GSS4             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned GSS                : 5;
    unsigned                    : 3;
    };

  struct
    {
    unsigned T3GSS              : 5;
    unsigned                    : 3;
    };
  } __T3GATEbits_t;

