OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define _CCP5CAP_CTS0           0x01
#define _CCP5CAP_CCP5CTS0       0x01
#define _CCP5CAP_CTS1           0x02
#define _CCP5CAP_CCP5CTS1       0x02
#define _CCP5CAP_CTS2           0x04
#define _CCP5CAP_CCP5CTS2       0x04

//==============================================================================


//==============================================================================
//        PWM6DCL Bits

extern __at(0x038C) __sfr PWM6DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM6DC0            : 1;
    unsigned PWM6DC1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWMPW0             : 1;
    unsigned PWMPW1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned DC                 : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM6DC             : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWMPW              : 2;
    };
  } __PWM6DCLbits_t;

extern __at(0x038C) volatile __PWM6DCLbits_t PWM6DCLbits;

#define _DC0                    0x40
#define _PWM6DC0                0x40
#define _PWMPW0                 0x40
#define _DC1                    0x80
#define _PWM6DC1                0x80
#define _PWMPW1                 0x80

//==============================================================================


//==============================================================================
//        PWM6DCH Bits

extern __at(0x038D) __sfr PWM6DCH;

typedef union
  {
  struct
    {
    unsigned DC2                : 1;
    unsigned DC3                : 1;
    unsigned DC4                : 1;
    unsigned DC5                : 1;
    unsigned DC6                : 1;
    unsigned DC7                : 1;
    unsigned DC8                : 1;
    unsigned DC9                : 1;
    };

  struct
    {
    unsigned PWM6DC2            : 1;
    unsigned PWM6DC3            : 1;
    unsigned PWM6DC4            : 1;
    unsigned PWM6DC5            : 1;
    unsigned PWM6DC6            : 1;
    unsigned PWM6DC7            : 1;
    unsigned PWM6DC8            : 1;
    unsigned PWM6DC9            : 1;
    };

  struct
    {
    unsigned PWMPW2             : 1;
    unsigned PWMPW3             : 1;
    unsigned PWMPW4             : 1;
    unsigned PWMPW5             : 1;
    unsigned PWMPW6             : 1;
    unsigned PWMPW7             : 1;
    unsigned PWMPW8             : 1;
    unsigned PWMPW9             : 1;
    };
  } __PWM6DCHbits_t;

extern __at(0x038D) volatile __PWM6DCHbits_t PWM6DCHbits;

#define _DC2                    0x01
#define _PWM6DC2                0x01
#define _PWMPW2                 0x01
#define _DC3                    0x02
#define _PWM6DC3                0x02
#define _PWMPW3                 0x02
#define _DC4                    0x04
#define _PWM6DC4                0x04
#define _PWMPW4                 0x04
#define _DC5                    0x08
#define _PWM6DC5                0x08
#define _PWMPW5                 0x08
#define _DC6                    0x10
#define _PWM6DC6                0x10
#define _PWMPW6                 0x10
#define _DC7                    0x20
#define _PWM6DC7                0x20
#define _PWMPW7                 0x20
#define _DC8                    0x40
#define _PWM6DC8                0x40
#define _PWMPW8                 0x40
#define _DC9                    0x80
#define _PWM6DC9                0x80
#define _PWMPW9                 0x80

//==============================================================================


//==============================================================================
//        PWM6CON Bits

extern __at(0x038E) __sfr PWM6CON;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned POL                : 1;
    unsigned OUT                : 1;
    unsigned OE                 : 1;
    unsigned EN                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM6POL            : 1;
    unsigned PWM6OUT            : 1;
    unsigned PWM6OE             : 1;
    unsigned PWM6EN             : 1;
    };
  } __PWM6CONbits_t;

extern __at(0x038E) volatile __PWM6CONbits_t PWM6CONbits;

#define _PWM6CON_POL            0x10
#define _PWM6CON_PWM6POL        0x10
#define _PWM6CON_OUT            0x20
#define _PWM6CON_PWM6OUT        0x20
#define _PWM6CON_OE             0x40
#define _PWM6CON_PWM6OE         0x40
#define _PWM6CON_EN             0x80
#define _PWM6CON_PWM6EN         0x80

//==============================================================================


//==============================================================================
//        PWM7DCL Bits

extern __at(0x0390) __sfr PWM7DCL;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned DC0                : 1;
    unsigned DC1                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWM7DC0            : 1;
    unsigned PWM7DC1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PWMPW0             : 1;
    unsigned PWMPW1             : 1;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWM7DC             : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned DC                 : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned PWMPW              : 2;
    };
  } __PWM7DCLbits_t;

