OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
extern __at(0x048F) __sfr SMT1CPRL;

typedef struct
  {
  unsigned CPR0                 : 1;
  unsigned CPR1                 : 1;
  unsigned CPR2                 : 1;
  unsigned CPR3                 : 1;
  unsigned CPR4                 : 1;
  unsigned CPR5                 : 1;
  unsigned CPR6                 : 1;
  unsigned CPR7                 : 1;
  } __SMT1CPRLbits_t;

extern __at(0x048F) volatile __SMT1CPRLbits_t SMT1CPRLbits;

#define _CPR0                   0x01
#define _CPR1                   0x02
#define _CPR2                   0x04
#define _CPR3                   0x08
#define _CPR4                   0x10
#define _CPR5                   0x20
#define _CPR6                   0x40
#define _CPR7                   0x80

//==============================================================================


//==============================================================================
//        SMT1CPRH Bits

extern __at(0x0490) __sfr SMT1CPRH;

typedef union
  {
  struct
    {
    unsigned CPR8               : 1;
    unsigned CPR9               : 1;
    unsigned CPR10              : 1;
    unsigned CPR11              : 1;
    unsigned CPR12              : 1;
    unsigned CPR13              : 1;
    unsigned CPR14              : 1;
    unsigned CPR15              : 1;
    };

  struct
    {
    unsigned SMT1CPR8           : 1;
    unsigned SMT1CPR9           : 1;
    unsigned SMT1CPR10          : 1;
    unsigned SMT1CPR11          : 1;
    unsigned SMT1CPR12          : 1;
    unsigned SMT1CPR13          : 1;
    unsigned SMT1CPR14          : 1;
    unsigned SMT1CPR15          : 1;
    };
  } __SMT1CPRHbits_t;

extern __at(0x0490) volatile __SMT1CPRHbits_t SMT1CPRHbits;

#define _CPR8                   0x01
#define _SMT1CPR8               0x01
#define _CPR9                   0x02
#define _SMT1CPR9               0x02
#define _CPR10                  0x04
#define _SMT1CPR10              0x04
#define _CPR11                  0x08
#define _SMT1CPR11              0x08
#define _CPR12                  0x10
#define _SMT1CPR12              0x10
#define _CPR13                  0x20
#define _SMT1CPR13              0x20
#define _CPR14                  0x40
#define _SMT1CPR14              0x40
#define _CPR15                  0x80
#define _SMT1CPR15              0x80

//==============================================================================


//==============================================================================
//        SMT1CPRU Bits

extern __at(0x0491) __sfr SMT1CPRU;

typedef union
  {
  struct
    {
    unsigned CPR16              : 1;
    unsigned CPR17              : 1;
    unsigned CPR18              : 1;
    unsigned CPR19              : 1;
    unsigned CPR20              : 1;
    unsigned CPR21              : 1;
    unsigned CPR22              : 1;
    unsigned CPR23              : 1;
    };

  struct
    {
    unsigned SMT1CPR16          : 1;
    unsigned SMT1CPR17          : 1;
    unsigned SMT1CPR18          : 1;
    unsigned SMT1CPR19          : 1;
    unsigned SMT1CPR20          : 1;
    unsigned SMT1CPR21          : 1;
    unsigned SMT1CPR22          : 1;
    unsigned SMT1CPR23          : 1;
    };
  } __SMT1CPRUbits_t;

extern __at(0x0491) volatile __SMT1CPRUbits_t SMT1CPRUbits;

#define _CPR16                  0x01
#define _SMT1CPR16              0x01
#define _CPR17                  0x02
#define _SMT1CPR17              0x02
#define _CPR18                  0x04
#define _SMT1CPR18              0x04
#define _CPR19                  0x08
#define _SMT1CPR19              0x08
#define _CPR20                  0x10
#define _SMT1CPR20              0x10
#define _CPR21                  0x20
#define _SMT1CPR21              0x20
#define _CPR22                  0x40
#define _SMT1CPR22              0x40
#define _CPR23                  0x80
#define _SMT1CPR23              0x80

//==============================================================================

extern __at(0x0492) __sfr SMT1CPW;

//==============================================================================
//        SMT1CPWL Bits

extern __at(0x0492) __sfr SMT1CPWL;

typedef union
  {
  struct
    {
    unsigned CPW0               : 1;
    unsigned CPW1               : 1;
    unsigned CPW2               : 1;
    unsigned CPW3               : 1;
    unsigned CPW4               : 1;
    unsigned CPW5               : 1;
    unsigned CPW6               : 1;
    unsigned CPW7               : 1;
    };

  struct
    {
    unsigned SMT1CPW0           : 1;
    unsigned SMT1CPW1           : 1;
    unsigned SMT1CPW2           : 1;
    unsigned SMT1CPW3           : 1;
    unsigned SMT1CPW4           : 1;
    unsigned SMT1CPW5           : 1;
    unsigned SMT1CPW6           : 1;
    unsigned SMT1CPW7           : 1;
    };
  } __SMT1CPWLbits_t;

extern __at(0x0492) volatile __SMT1CPWLbits_t SMT1CPWLbits;

#define _CPW0                   0x01
#define _SMT1CPW0               0x01
#define _CPW1                   0x02
#define _SMT1CPW1               0x02
#define _CPW2                   0x04
#define _SMT1CPW2               0x04
#define _CPW3                   0x08
#define _SMT1CPW3               0x08
#define _CPW4                   0x10
#define _SMT1CPW4               0x10
#define _CPW5                   0x20
#define _SMT1CPW5               0x20
#define _CPW6                   0x40
#define _SMT1CPW6               0x40
#define _CPW7                   0x80
#define _SMT1CPW7               0x80

//==============================================================================


//==============================================================================
//        SMT1CPWH Bits

extern __at(0x0493) __sfr SMT1CPWH;

typedef union
  {
  struct
    {
    unsigned CPW8               : 1;
    unsigned CPW9               : 1;
    unsigned CPW10              : 1;
    unsigned CPW11              : 1;
    unsigned CPW12              : 1;
    unsigned CPW13              : 1;
    unsigned CPW14              : 1;
    unsigned CPW15              : 1;
    };

  struct
    {
    unsigned SMT1CPW8           : 1;
    unsigned SMT1CPW9           : 1;
    unsigned SMT1CPW10          : 1;
    unsigned SMT1CPW11          : 1;
    unsigned SMT1CPW12          : 1;
    unsigned SMT1CPW13          : 1;
    unsigned SMT1CPW14          : 1;
    unsigned SMT1CPW15          : 1;
    };
  } __SMT1CPWHbits_t;

extern __at(0x0493) volatile __SMT1CPWHbits_t SMT1CPWHbits;

#define _CPW8                   0x01
#define _SMT1CPW8               0x01
#define _CPW9                   0x02
#define _SMT1CPW9               0x02
#define _CPW10                  0x04
#define _SMT1CPW10              0x04
#define _CPW11                  0x08
#define _SMT1CPW11              0x08
#define _CPW12                  0x10
#define _SMT1CPW12              0x10
#define _CPW13                  0x20
#define _SMT1CPW13              0x20
#define _CPW14                  0x40
#define _SMT1CPW14              0x40
#define _CPW15                  0x80
#define _SMT1CPW15              0x80

//==============================================================================


//==============================================================================
//        SMT1CPWU Bits

