OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define _RD6PPS0                0x01
#define _RD6PPS1                0x02
#define _RD6PPS2                0x04
#define _RD6PPS3                0x08
#define _RD6PPS4                0x10
#define _RD6PPS5                0x20

//==============================================================================


//==============================================================================
//        RD7PPS Bits

extern __at(0x0F2F) __sfr RD7PPS;

typedef union
  {
  struct
    {
    unsigned RD7PPS0            : 1;
    unsigned RD7PPS1            : 1;
    unsigned RD7PPS2            : 1;
    unsigned RD7PPS3            : 1;
    unsigned RD7PPS4            : 1;
    unsigned RD7PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RD7PPS             : 6;
    unsigned                    : 2;
    };
  } __RD7PPSbits_t;

extern __at(0x0F2F) volatile __RD7PPSbits_t RD7PPSbits;

#define _RD7PPS0                0x01
#define _RD7PPS1                0x02
#define _RD7PPS2                0x04
#define _RD7PPS3                0x08
#define _RD7PPS4                0x10
#define _RD7PPS5                0x20

//==============================================================================


//==============================================================================
//        RE0PPS Bits

extern __at(0x0F30) __sfr RE0PPS;

typedef union
  {
  struct
    {
    unsigned RE0PPS0            : 1;
    unsigned RE0PPS1            : 1;
    unsigned RE0PPS2            : 1;
    unsigned RE0PPS3            : 1;
    unsigned RE0PPS4            : 1;
    unsigned RE0PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE0PPS             : 6;
    unsigned                    : 2;
    };
  } __RE0PPSbits_t;

extern __at(0x0F30) volatile __RE0PPSbits_t RE0PPSbits;

#define _RE0PPS0                0x01
#define _RE0PPS1                0x02
#define _RE0PPS2                0x04
#define _RE0PPS3                0x08
#define _RE0PPS4                0x10
#define _RE0PPS5                0x20

//==============================================================================


//==============================================================================
//        RE1PPS Bits

extern __at(0x0F31) __sfr RE1PPS;

typedef union
  {
  struct
    {
    unsigned RE1PPS0            : 1;
    unsigned RE1PPS1            : 1;
    unsigned RE1PPS2            : 1;
    unsigned RE1PPS3            : 1;
    unsigned RE1PPS4            : 1;
    unsigned RE1PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE1PPS             : 6;
    unsigned                    : 2;
    };
  } __RE1PPSbits_t;

extern __at(0x0F31) volatile __RE1PPSbits_t RE1PPSbits;

#define _RE1PPS0                0x01
#define _RE1PPS1                0x02
#define _RE1PPS2                0x04
#define _RE1PPS3                0x08
#define _RE1PPS4                0x10
#define _RE1PPS5                0x20

//==============================================================================


//==============================================================================
//        RE2PPS Bits

extern __at(0x0F32) __sfr RE2PPS;

typedef union
  {
  struct
    {
    unsigned RE2PPS0            : 1;
    unsigned RE2PPS1            : 1;
    unsigned RE2PPS2            : 1;
    unsigned RE2PPS3            : 1;
    unsigned RE2PPS4            : 1;
    unsigned RE2PPS5            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RE2PPS             : 6;
    unsigned                    : 2;
    };
  } __RE2PPSbits_t;

extern __at(0x0F32) volatile __RE2PPSbits_t RE2PPSbits;

#define _RE2PPS0                0x01
#define _RE2PPS1                0x02
#define _RE2PPS2                0x04
#define _RE2PPS3                0x08
#define _RE2PPS4                0x10
#define _RE2PPS5                0x20

//==============================================================================


//==============================================================================
//        ANSELA Bits

extern __at(0x0F38) __sfr ANSELA;

typedef struct
  {
  unsigned ANSA0                : 1;
  unsigned ANSA1                : 1;
  unsigned ANSA2                : 1;
  unsigned ANSA3                : 1;
  unsigned ANSA4                : 1;
  unsigned ANSA5                : 1;
  unsigned ANSA6                : 1;
  unsigned ANSA7                : 1;
  } __ANSELAbits_t;

extern __at(0x0F38) volatile __ANSELAbits_t ANSELAbits;

#define _ANSA0                  0x01
#define _ANSA1                  0x02
#define _ANSA2                  0x04
#define _ANSA3                  0x08
#define _ANSA4                  0x10
#define _ANSA5                  0x20
#define _ANSA6                  0x40
#define _ANSA7                  0x80

//==============================================================================


//==============================================================================
//        WPUA Bits

extern __at(0x0F39) __sfr WPUA;

typedef struct
  {
  unsigned WPUA0                : 1;
  unsigned WPUA1                : 1;
  unsigned WPUA2                : 1;
  unsigned WPUA3                : 1;
  unsigned WPUA4                : 1;
  unsigned WPUA5                : 1;
  unsigned WPUA6                : 1;
  unsigned WPUA7                : 1;
  } __WPUAbits_t;

extern __at(0x0F39) volatile __WPUAbits_t WPUAbits;

#define _WPUA0                  0x01
#define _WPUA1                  0x02
#define _WPUA2                  0x04
#define _WPUA3                  0x08
#define _WPUA4                  0x10
#define _WPUA5                  0x20
#define _WPUA6                  0x40
#define _WPUA7                  0x80

//==============================================================================


//==============================================================================
//        ODCONA Bits

extern __at(0x0F3A) __sfr ODCONA;

typedef struct
  {
  unsigned ODCA0                : 1;
  unsigned ODCA1                : 1;
  unsigned ODCA2                : 1;
  unsigned ODCA3                : 1;
  unsigned ODCA4                : 1;
  unsigned ODCA5                : 1;
  unsigned ODCA6                : 1;
  unsigned ODCA7                : 1;
  } __ODCONAbits_t;

extern __at(0x0F3A) volatile __ODCONAbits_t ODCONAbits;

#define _ODCA0                  0x01
#define _ODCA1                  0x02
#define _ODCA2                  0x04
#define _ODCA3                  0x08
#define _ODCA4                  0x10
#define _ODCA5                  0x20
#define _ODCA6                  0x40
#define _ODCA7                  0x80

//==============================================================================


//==============================================================================
//        SLRCONA Bits

extern __at(0x0F3B) __sfr SLRCONA;

typedef struct
  {
  unsigned SLRA0                : 1;
  unsigned SLRA1                : 1;
  unsigned SLRA2                : 1;
  unsigned SLRA3                : 1;
  unsigned SLRA4                : 1;
  unsigned SLRA5                : 1;
  unsigned SLRA6                : 1;
  unsigned SLRA7                : 1;
  } __SLRCONAbits_t;

extern __at(0x0F3B) volatile __SLRCONAbits_t SLRCONAbits;

