OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
extern __at(0x0F56) volatile __CCDNCbits_t CCDNCbits;

#define _CCDNC0                 0x01
#define _CCDNC1                 0x02
#define _CCDNC2                 0x04
#define _CCDNC3                 0x08
#define _CCDNC4                 0x10
#define _CCDNC5                 0x20
#define _CCDNC6                 0x40
#define _CCDNC7                 0x80

//==============================================================================


//==============================================================================
//        CCDPC Bits

extern __at(0x0F57) __sfr CCDPC;

typedef struct
  {
  unsigned CCDPC0               : 1;
  unsigned CCDPC1               : 1;
  unsigned CCDPC2               : 1;
  unsigned CCDPC3               : 1;
  unsigned CCDPC4               : 1;
  unsigned CCDPC5               : 1;
  unsigned CCDPC6               : 1;
  unsigned CCDPC7               : 1;
  } __CCDPCbits_t;

extern __at(0x0F57) volatile __CCDPCbits_t CCDPCbits;

#define _CCDPC0                 0x01
#define _CCDPC1                 0x02
#define _CCDPC2                 0x04
#define _CCDPC3                 0x08
#define _CCDPC4                 0x10
#define _CCDPC5                 0x20
#define _CCDPC6                 0x40
#define _CCDPC7                 0x80

//==============================================================================


//==============================================================================
//        ANSELD Bits

extern __at(0x0F59) __sfr ANSELD;

typedef struct
  {
  unsigned ANSD0                : 1;
  unsigned ANSD1                : 1;
  unsigned ANSD2                : 1;
  unsigned ANSD3                : 1;
  unsigned ANSD4                : 1;
  unsigned ANSD5                : 1;
  unsigned ANSD6                : 1;
  unsigned ANSD7                : 1;
  } __ANSELDbits_t;

extern __at(0x0F59) volatile __ANSELDbits_t ANSELDbits;

#define _ANSD0                  0x01
#define _ANSD1                  0x02
#define _ANSD2                  0x04
#define _ANSD3                  0x08
#define _ANSD4                  0x10
#define _ANSD5                  0x20
#define _ANSD6                  0x40
#define _ANSD7                  0x80

//==============================================================================


//==============================================================================
//        WPUD Bits

extern __at(0x0F5A) __sfr WPUD;

typedef struct
  {
  unsigned WPUD0                : 1;
  unsigned WPUD1                : 1;
  unsigned WPUD2                : 1;
  unsigned WPUD3                : 1;
  unsigned WPUD4                : 1;
  unsigned WPUD5                : 1;
  unsigned WPUD6                : 1;
  unsigned WPUD7                : 1;
  } __WPUDbits_t;

extern __at(0x0F5A) volatile __WPUDbits_t WPUDbits;

#define _WPUD0                  0x01
#define _WPUD1                  0x02
#define _WPUD2                  0x04
#define _WPUD3                  0x08
#define _WPUD4                  0x10
#define _WPUD5                  0x20
#define _WPUD6                  0x40
#define _WPUD7                  0x80

//==============================================================================


//==============================================================================
//        ODCOND Bits

extern __at(0x0F5B) __sfr ODCOND;

typedef struct
  {
  unsigned ODCD0                : 1;
  unsigned ODCD1                : 1;
  unsigned ODCD2                : 1;
  unsigned ODCD3                : 1;
  unsigned ODCD4                : 1;
  unsigned ODCD5                : 1;
  unsigned ODCD6                : 1;
  unsigned ODCD7                : 1;
  } __ODCONDbits_t;

extern __at(0x0F5B) volatile __ODCONDbits_t ODCONDbits;

#define _ODCD0                  0x01
#define _ODCD1                  0x02
#define _ODCD2                  0x04
#define _ODCD3                  0x08
#define _ODCD4                  0x10
#define _ODCD5                  0x20
#define _ODCD6                  0x40
#define _ODCD7                  0x80

//==============================================================================


//==============================================================================
//        SLRCOND Bits

extern __at(0x0F5C) __sfr SLRCOND;

typedef struct
  {
  unsigned SLRD0                : 1;
  unsigned SLRD1                : 1;
  unsigned SLRD2                : 1;
  unsigned SLRD3                : 1;
  unsigned SLRD4                : 1;
  unsigned SLRD5                : 1;
  unsigned SLRD6                : 1;
  unsigned SLRD7                : 1;
  } __SLRCONDbits_t;

extern __at(0x0F5C) volatile __SLRCONDbits_t SLRCONDbits;

#define _SLRD0                  0x01
#define _SLRD1                  0x02
#define _SLRD2                  0x04
#define _SLRD3                  0x08
#define _SLRD4                  0x10
#define _SLRD5                  0x20
#define _SLRD6                  0x40
#define _SLRD7                  0x80

//==============================================================================


//==============================================================================
//        INLVLD Bits

extern __at(0x0F5D) __sfr INLVLD;

typedef struct
  {
  unsigned INLVLD0              : 1;
  unsigned INLVLD1              : 1;
  unsigned INLVLD2              : 1;
  unsigned INLVLD3              : 1;
  unsigned INLVLD4              : 1;
  unsigned INLVLD5              : 1;
  unsigned INLVLD6              : 1;
  unsigned INLVLD7              : 1;
  } __INLVLDbits_t;

extern __at(0x0F5D) volatile __INLVLDbits_t INLVLDbits;

#define _INLVLD0                0x01
#define _INLVLD1                0x02
#define _INLVLD2                0x04
#define _INLVLD3                0x08
#define _INLVLD4                0x10
#define _INLVLD5                0x20
#define _INLVLD6                0x40
#define _INLVLD7                0x80

//==============================================================================


//==============================================================================
//        CCDND Bits

extern __at(0x0F61) __sfr CCDND;

typedef struct
  {
  unsigned CCDND0               : 1;
  unsigned CCDND1               : 1;
  unsigned CCDND2               : 1;
  unsigned CCDND3               : 1;
  unsigned CCDND4               : 1;
  unsigned CCDND5               : 1;
  unsigned CCDND6               : 1;
  unsigned CCDND7               : 1;
  } __CCDNDbits_t;

extern __at(0x0F61) volatile __CCDNDbits_t CCDNDbits;

