OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define _CCDND0                 0x01
#define _CCDND1                 0x02
#define _CCDND2                 0x04
#define _CCDND3                 0x08
#define _CCDND4                 0x10
#define _CCDND5                 0x20
#define _CCDND6                 0x40
#define _CCDND7                 0x80

//==============================================================================


//==============================================================================
//        CCDPD Bits

extern __at(0x0F62) __sfr CCDPD;

typedef struct
  {
  unsigned CCDPD0               : 1;
  unsigned CCDPD1               : 1;
  unsigned CCDPD2               : 1;
  unsigned CCDPD3               : 1;
  unsigned CCDPD4               : 1;
  unsigned CCDPD5               : 1;
  unsigned CCDPD6               : 1;
  unsigned CCDPD7               : 1;
  } __CCDPDbits_t;

extern __at(0x0F62) volatile __CCDPDbits_t CCDPDbits;

#define _CCDPD0                 0x01
#define _CCDPD1                 0x02
#define _CCDPD2                 0x04
#define _CCDPD3                 0x08
#define _CCDPD4                 0x10
#define _CCDPD5                 0x20
#define _CCDPD6                 0x40
#define _CCDPD7                 0x80

//==============================================================================


//==============================================================================
//        ANSELE Bits

extern __at(0x0F64) __sfr ANSELE;

typedef union
  {
  struct
    {
    unsigned ANSE0              : 1;
    unsigned ANSE1              : 1;
    unsigned ANSE2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ANSE               : 3;
    unsigned                    : 5;
    };
  } __ANSELEbits_t;

extern __at(0x0F64) volatile __ANSELEbits_t ANSELEbits;

#define _ANSE0                  0x01
#define _ANSE1                  0x02
#define _ANSE2                  0x04

//==============================================================================


//==============================================================================
//        WPUE Bits

extern __at(0x0F65) __sfr WPUE;

typedef union
  {
  struct
    {
    unsigned WPUE0              : 1;
    unsigned WPUE1              : 1;
    unsigned WPUE2              : 1;
    unsigned WPUE3              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned WPUE               : 4;
    unsigned                    : 4;
    };
  } __WPUEbits_t;

extern __at(0x0F65) volatile __WPUEbits_t WPUEbits;

#define _WPUE0                  0x01
#define _WPUE1                  0x02
#define _WPUE2                  0x04
#define _WPUE3                  0x08

//==============================================================================


//==============================================================================
//        ODCONE Bits

extern __at(0x0F66) __sfr ODCONE;

typedef union
  {
  struct
    {
    unsigned ODCE0              : 1;
    unsigned ODCE1              : 1;
    unsigned ODCE2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ODCE               : 3;
    unsigned                    : 5;
    };
  } __ODCONEbits_t;

extern __at(0x0F66) volatile __ODCONEbits_t ODCONEbits;

#define _ODCE0                  0x01
#define _ODCE1                  0x02
#define _ODCE2                  0x04

//==============================================================================


//==============================================================================
//        SLRCONE Bits

extern __at(0x0F67) __sfr SLRCONE;

typedef union
  {
  struct
    {
    unsigned SLRE0              : 1;
    unsigned SLRE1              : 1;
    unsigned SLRE2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SLRE               : 3;
    unsigned                    : 5;
    };
  } __SLRCONEbits_t;

extern __at(0x0F67) volatile __SLRCONEbits_t SLRCONEbits;

#define _SLRE0                  0x01
#define _SLRE1                  0x02
#define _SLRE2                  0x04

//==============================================================================


//==============================================================================
//        INLVLE Bits

extern __at(0x0F68) __sfr INLVLE;

typedef union
  {
  struct
    {
    unsigned INLVLE0            : 1;
    unsigned INLVLE1            : 1;
    unsigned INLVLE2            : 1;
    unsigned INLVLE3            : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned INLVLE             : 4;
    unsigned                    : 4;
    };
  } __INLVLEbits_t;

extern __at(0x0F68) volatile __INLVLEbits_t INLVLEbits;

#define _INLVLE0                0x01
#define _INLVLE1                0x02
#define _INLVLE2                0x04
#define _INLVLE3                0x08

//==============================================================================


//==============================================================================
//        IOCEP Bits

extern __at(0x0F69) __sfr IOCEP;

typedef struct
  {
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IOCEP3               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __IOCEPbits_t;

