OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define INTF                    PIR0bits.INTF                   // bit 0
#define IOCIF                   PIR0bits.IOCIF                  // bit 4
#define TMR0IF                  PIR0bits.TMR0IF                 // bit 5

#define ADIF                    PIR1bits.ADIF                   // bit 0
#define ADTIF                   PIR1bits.ADTIF                  // bit 1
#define CSWIF                   PIR1bits.CSWIF                  // bit 6
#define OSFIF                   PIR1bits.OSFIF                  // bit 7

#define C1IF                    PIR2bits.C1IF                   // bit 0
#define C2IF                    PIR2bits.C2IF                   // bit 1
#define ZCDIF                   PIR2bits.ZCDIF                  // bit 6

#define SSP1IF                  PIR3bits.SSP1IF                 // bit 0
#define BCL1IF                  PIR3bits.BCL1IF                 // bit 1
#define SSP2IF                  PIR3bits.SSP2IF                 // bit 2
#define BCL2IF                  PIR3bits.BCL2IF                 // bit 3
#define TXIF                    PIR3bits.TXIF                   // bit 4
#define RCIF                    PIR3bits.RCIF                   // bit 5

#define TMR1IF                  PIR4bits.TMR1IF                 // bit 0
#define TMR2IF                  PIR4bits.TMR2IF                 // bit 1
#define TMR3IF                  PIR4bits.TMR3IF                 // bit 2
#define TMR4IF                  PIR4bits.TMR4IF                 // bit 3
#define TMR5IF                  PIR4bits.TMR5IF                 // bit 4
#define TMR6IF                  PIR4bits.TMR6IF                 // bit 5

#define TMR1GIF                 PIR5bits.TMR1GIF                // bit 0
#define TMR3GIF                 PIR5bits.TMR3GIF                // bit 1
#define TMR5GIF                 PIR5bits.TMR5GIF                // bit 2
#define CLC1IF                  PIR5bits.CLC1IF                 // bit 4
#define CLC2IF                  PIR5bits.CLC2IF                 // bit 5
#define CLC3IF                  PIR5bits.CLC3IF                 // bit 6
#define CLC4IF                  PIR5bits.CLC4IF                 // bit 7

#define CCP1IF                  PIR6bits.CCP1IF                 // bit 0
#define CCP2IF                  PIR6bits.CCP2IF                 // bit 1
#define CCP3IF                  PIR6bits.CCP3IF                 // bit 2
#define CCP4IF                  PIR6bits.CCP4IF                 // bit 3
#define CCP5IF                  PIR6bits.CCP5IF                 // bit 4

#define CWG1IF                  PIR7bits.CWG1IF                 // bit 0
#define CWG2IF                  PIR7bits.CWG2IF                 // bit 1
#define CWG3IF                  PIR7bits.CWG3IF                 // bit 2
#define NCO1IF                  PIR7bits.NCO1IF                 // bit 4, shadows bit in PIR7bits
#define NCOIF                   PIR7bits.NCOIF                  // bit 4, shadows bit in PIR7bits
#define NVMIF                   PIR7bits.NVMIF                  // bit 5
#define CRCIF                   PIR7bits.CRCIF                  // bit 6
#define SCANIF                  PIR7bits.SCANIF                 // bit 7

#define SMT1IF                  PIR8bits.SMT1IF                 // bit 0
#define SMT1PRAIF               PIR8bits.SMT1PRAIF              // bit 1
#define SMT1PWAIF               PIR8bits.SMT1PWAIF              // bit 2
#define SMT2IF                  PIR8bits.SMT2IF                 // bit 3
#define SMT2PRAIF               PIR8bits.SMT2PRAIF              // bit 4
#define SMT2PWAIF               PIR8bits.SMT2PWAIF              // bit 5

#define IOCMD                   PMD0bits.IOCMD                  // bit 0
#define CLKRMD                  PMD0bits.CLKRMD                 // bit 1
#define NVMMD                   PMD0bits.NVMMD                  // bit 2
#define SCANMD                  PMD0bits.SCANMD                 // bit 3
#define CRCMD                   PMD0bits.CRCMD                  // bit 4
#define FVRMD                   PMD0bits.FVRMD                  // bit 6
#define SYSCMD                  PMD0bits.SYSCMD                 // bit 7

#define TMR0MD                  PMD1bits.TMR0MD                 // bit 0
#define TMR1MD                  PMD1bits.TMR1MD                 // bit 1
#define TMR2MD                  PMD1bits.TMR2MD                 // bit 2
#define TMR3MD                  PMD1bits.TMR3MD                 // bit 3
#define TMR4MD                  PMD1bits.TMR4MD                 // bit 4
#define TMR5MD                  PMD1bits.TMR5MD                 // bit 5
#define TMR6MD                  PMD1bits.TMR6MD                 // bit 6
#define NCOMD                   PMD1bits.NCOMD                  // bit 7, shadows bit in PMD1bits
#define NCO1MD                  PMD1bits.NCO1MD                 // bit 7, shadows bit in PMD1bits

#define ZCDMD                   PMD2bits.ZCDMD                  // bit 0
#define CMP1MD                  PMD2bits.CMP1MD                 // bit 1
#define CMP2MD                  PMD2bits.CMP2MD                 // bit 2
#define ADCMD                   PMD2bits.ADCMD                  // bit 5
#define DACMD                   PMD2bits.DACMD                  // bit 6

#define CCP1MD                  PMD3bits.CCP1MD                 // bit 0
#define CCP2MD                  PMD3bits.CCP2MD                 // bit 1
#define CCP3MD                  PMD3bits.CCP3MD                 // bit 2
#define CCP4MD                  PMD3bits.CCP4MD                 // bit 3
#define CCP5MD                  PMD3bits.CCP5MD                 // bit 4
#define PWM6MD                  PMD3bits.PWM6MD                 // bit 5
#define PWM7MD                  PMD3bits.PWM7MD                 // bit 6

#define CWG1MD                  PMD4bits.CWG1MD                 // bit 0
#define CWG2MD                  PMD4bits.CWG2MD                 // bit 1
#define CWG3MD                  PMD4bits.CWG3MD                 // bit 2
#define MSSP1MD                 PMD4bits.MSSP1MD                // bit 4
#define MSSP2MD                 PMD4bits.MSSP2MD                // bit 5
#define UART1MD                 PMD4bits.UART1MD                // bit 6

