OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define SMT2PR8                 SMT2PRHbits.SMT2PR8             // bit 0
#define SMT2PR9                 SMT2PRHbits.SMT2PR9             // bit 1
#define SMT2PR10                SMT2PRHbits.SMT2PR10            // bit 2
#define SMT2PR11                SMT2PRHbits.SMT2PR11            // bit 3
#define SMT2PR12                SMT2PRHbits.SMT2PR12            // bit 4
#define SMT2PR13                SMT2PRHbits.SMT2PR13            // bit 5
#define SMT2PR14                SMT2PRHbits.SMT2PR14            // bit 6
#define SMT2PR15                SMT2PRHbits.SMT2PR15            // bit 7

#define SMT2PR0                 SMT2PRLbits.SMT2PR0             // bit 0
#define SMT2PR1                 SMT2PRLbits.SMT2PR1             // bit 1
#define SMT2PR2                 SMT2PRLbits.SMT2PR2             // bit 2
#define SMT2PR3                 SMT2PRLbits.SMT2PR3             // bit 3
#define SMT2PR4                 SMT2PRLbits.SMT2PR4             // bit 4
#define SMT2PR5                 SMT2PRLbits.SMT2PR5             // bit 5
#define SMT2PR6                 SMT2PRLbits.SMT2PR6             // bit 6
#define SMT2PR7                 SMT2PRLbits.SMT2PR7             // bit 7

#define SMT2PR16                SMT2PRUbits.SMT2PR16            // bit 0
#define SMT2PR17                SMT2PRUbits.SMT2PR17            // bit 1
#define SMT2PR18                SMT2PRUbits.SMT2PR18            // bit 2
#define SMT2PR19                SMT2PRUbits.SMT2PR19            // bit 3
#define SMT2PR20                SMT2PRUbits.SMT2PR20            // bit 4
#define SMT2PR21                SMT2PRUbits.SMT2PR21            // bit 5
#define SMT2PR22                SMT2PRUbits.SMT2PR22            // bit 6
#define SMT2PR23                SMT2PRUbits.SMT2PR23            // bit 7

#define SMU2SIGPPS0             SMT2SIGPPSbits.SMU2SIGPPS0      // bit 0
#define SMU2SIGPPS1             SMT2SIGPPSbits.SMU2SIGPPS1      // bit 1
#define SMU2SIGPPS2             SMT2SIGPPSbits.SMU2SIGPPS2      // bit 2
#define SMU2SIGPPS3             SMT2SIGPPSbits.SMU2SIGPPS3      // bit 3
#define SMU2SIGPPS4             SMT2SIGPPSbits.SMU2SIGPPS4      // bit 4

#define SMT2TMR8                SMT2TMRHbits.SMT2TMR8           // bit 0
#define SMT2TMR9                SMT2TMRHbits.SMT2TMR9           // bit 1
#define SMT2TMR10               SMT2TMRHbits.SMT2TMR10          // bit 2
#define SMT2TMR11               SMT2TMRHbits.SMT2TMR11          // bit 3
#define SMT2TMR12               SMT2TMRHbits.SMT2TMR12          // bit 4
#define SMT2TMR13               SMT2TMRHbits.SMT2TMR13          // bit 5
#define SMT2TMR14               SMT2TMRHbits.SMT2TMR14          // bit 6
#define SMT2TMR15               SMT2TMRHbits.SMT2TMR15          // bit 7

#define SMT2TMR0                SMT2TMRLbits.SMT2TMR0           // bit 0
#define SMT2TMR1                SMT2TMRLbits.SMT2TMR1           // bit 1
#define SMT2TMR2                SMT2TMRLbits.SMT2TMR2           // bit 2
#define SMT2TMR3                SMT2TMRLbits.SMT2TMR3           // bit 3
#define SMT2TMR4                SMT2TMRLbits.SMT2TMR4           // bit 4
#define SMT2TMR5                SMT2TMRLbits.SMT2TMR5           // bit 5
#define SMT2TMR6                SMT2TMRLbits.SMT2TMR6           // bit 6
#define SMT2TMR7                SMT2TMRLbits.SMT2TMR7           // bit 7

#define SMT2TMR16               SMT2TMRUbits.SMT2TMR16          // bit 0
#define SMT2TMR17               SMT2TMRUbits.SMT2TMR17          // bit 1
#define SMT2TMR18               SMT2TMRUbits.SMT2TMR18          // bit 2
#define SMT2TMR19               SMT2TMRUbits.SMT2TMR19          // bit 3
#define SMT2TMR20               SMT2TMRUbits.SMT2TMR20          // bit 4
#define SMT2TMR21               SMT2TMRUbits.SMT2TMR21          // bit 5
#define SMT2TMR22               SMT2TMRUbits.SMT2TMR22          // bit 6
#define SMT2TMR23               SMT2TMRUbits.SMT2TMR23          // bit 7

#define SMU2WINPPS0             SMT2WINPPSbits.SMU2WINPPS0      // bit 0
#define SMU2WINPPS1             SMT2WINPPSbits.SMU2WINPPS1      // bit 1
#define SMU2WINPPS2             SMT2WINPPSbits.SMU2WINPPS2      // bit 2
#define SMU2WINPPS3             SMT2WINPPSbits.SMU2WINPPS3      // bit 3
#define SMU2WINPPS4             SMT2WINPPSbits.SMU2WINPPS4      // bit 4

#define SSP1CLKPPS0             SSP1CLKPPSbits.SSP1CLKPPS0      // bit 0
#define SSP1CLKPPS1             SSP1CLKPPSbits.SSP1CLKPPS1      // bit 1
#define SSP1CLKPPS2             SSP1CLKPPSbits.SSP1CLKPPS2      // bit 2
#define SSP1CLKPPS3             SSP1CLKPPSbits.SSP1CLKPPS3      // bit 3
#define SSP1CLKPPS4             SSP1CLKPPSbits.SSP1CLKPPS4      // bit 4

#define SSPM0                   SSP1CON1bits.SSPM0              // bit 0
#define SSPM1                   SSP1CON1bits.SSPM1              // bit 1
#define SSPM2                   SSP1CON1bits.SSPM2              // bit 2
#define SSPM3                   SSP1CON1bits.SSPM3              // bit 3
#define CKP                     SSP1CON1bits.CKP                // bit 4
#define SSPEN                   SSP1CON1bits.SSPEN              // bit 5
#define SSPOV                   SSP1CON1bits.SSPOV              // bit 6
#define WCOL                    SSP1CON1bits.WCOL               // bit 7

#define SEN                     SSP1CON2bits.SEN                // bit 0
#define RSEN                    SSP1CON2bits.RSEN               // bit 1, shadows bit in SSP1CON2bits
#define ADMSK1                  SSP1CON2bits.ADMSK1             // bit 1, shadows bit in SSP1CON2bits
#define PEN                     SSP1CON2bits.PEN                // bit 2, shadows bit in SSP1CON2bits
#define ADMSK2                  SSP1CON2bits.ADMSK2             // bit 2, shadows bit in SSP1CON2bits
#define RCEN                    SSP1CON2bits.RCEN               // bit 3, shadows bit in SSP1CON2bits
#define ADMSK3                  SSP1CON2bits.ADMSK3             // bit 3, shadows bit in SSP1CON2bits
#define ACKEN                   SSP1CON2bits.ACKEN              // bit 4, shadows bit in SSP1CON2bits
#define ADMSK4                  SSP1CON2bits.ADMSK4             // bit 4, shadows bit in SSP1CON2bits
#define ACKDT                   SSP1CON2bits.ACKDT              // bit 5, shadows bit in SSP1CON2bits
#define ADMSK5                  SSP1CON2bits.ADMSK5             // bit 5, shadows bit in SSP1CON2bits
#define ACKSTAT                 SSP1CON2bits.ACKSTAT            // bit 6
#define GCEN                    SSP1CON2bits.GCEN               // bit 7

#define DHEN                    SSP1CON3bits.DHEN               // bit 0
#define AHEN                    SSP1CON3bits.AHEN               // bit 1
#define SBCDE                   SSP1CON3bits.SBCDE              // bit 2
#define SDAHT                   SSP1CON3bits.SDAHT              // bit 3
#define BOEN                    SSP1CON3bits.BOEN               // bit 4
#define SCIE                    SSP1CON3bits.SCIE               // bit 5
#define PCIE                    SSP1CON3bits.PCIE               // bit 6
#define ACKTIM                  SSP1CON3bits.ACKTIM             // bit 7

#define SSP1DATPPS0             SSP1DATPPSbits.SSP1DATPPS0      // bit 0
#define SSP1DATPPS1             SSP1DATPPSbits.SSP1DATPPS1      // bit 1
#define SSP1DATPPS2             SSP1DATPPSbits.SSP1DATPPS2      // bit 2
#define SSP1DATPPS3             SSP1DATPPSbits.SSP1DATPPS3      // bit 3
#define SSP1DATPPS4             SSP1DATPPSbits.SSP1DATPPS4      // bit 4

#define MSK0                    SSP1MSKbits.MSK0                // bit 0
#define MSK1                    SSP1MSKbits.MSK1                // bit 1
#define MSK2                    SSP1MSKbits.MSK2                // bit 2
#define MSK3                    SSP1MSKbits.MSK3                // bit 3
#define MSK4                    SSP1MSKbits.MSK4                // bit 4
#define MSK5                    SSP1MSKbits.MSK5                // bit 5
#define MSK6                    SSP1MSKbits.MSK6                // bit 6
#define MSK7                    SSP1MSKbits.MSK7                // bit 7

#define SSP1SSPPS0              SSP1SSPPSbits.SSP1SSPPS0        // bit 0
#define SSP1SSPPS1              SSP1SSPPSbits.SSP1SSPPS1        // bit 1
#define SSP1SSPPS2              SSP1SSPPSbits.SSP1SSPPS2        // bit 2
#define SSP1SSPPS3              SSP1SSPPSbits.SSP1SSPPS3        // bit 3
#define SSP1SSPPS4              SSP1SSPPSbits.SSP1SSPPS4        // bit 4

#define BF                      SSP1STATbits.BF                 // bit 0
#define UA                      SSP1STATbits.UA                 // bit 1
#define R_NOT_W                 SSP1STATbits.R_NOT_W            // bit 2, shadows bit in SSP1STATbits
#define R_W                     SSP1STATbits.R_W                // bit 2, shadows bit in SSP1STATbits
#define NOT_W                   SSP1STATbits.NOT_W              // bit 2, shadows bit in SSP1STATbits
#define NOT_WRITE               SSP1STATbits.NOT_WRITE          // bit 2, shadows bit in SSP1STATbits
#define READ_WRITE              SSP1STATbits.READ_WRITE         // bit 2, shadows bit in SSP1STATbits
#define I2C_READ                SSP1STATbits.I2C_READ           // bit 2, shadows bit in SSP1STATbits
#define S                       SSP1STATbits.S                  // bit 3, shadows bit in SSP1STATbits
#define I2C_START               SSP1STATbits.I2C_START          // bit 3, shadows bit in SSP1STATbits
#define P                       SSP1STATbits.P                  // bit 4, shadows bit in SSP1STATbits
#define I2C_STOP                SSP1STATbits.I2C_STOP           // bit 4, shadows bit in SSP1STATbits
#define D_NOT_A                 SSP1STATbits.D_NOT_A            // bit 5, shadows bit in SSP1STATbits
#define D_A                     SSP1STATbits.D_A                // bit 5, shadows bit in SSP1STATbits
#define NOT_A                   SSP1STATbits.NOT_A              // bit 5, shadows bit in SSP1STATbits
#define NOT_ADDRESS             SSP1STATbits.NOT_ADDRESS        // bit 5, shadows bit in SSP1STATbits
#define DATA_ADDRESS            SSP1STATbits.DATA_ADDRESS       // bit 5, shadows bit in SSP1STATbits
#define I2C_DAT                 SSP1STATbits.I2C_DAT            // bit 5, shadows bit in SSP1STATbits
#define CKE                     SSP1STATbits.CKE                // bit 6
#define SMP                     SSP1STATbits.SMP                // bit 7

#define SSP2CLKPPS0             SSP2CLKPPSbits.SSP2CLKPPS0      // bit 0
#define SSP2CLKPPS1             SSP2CLKPPSbits.SSP2CLKPPS1      // bit 1
#define SSP2CLKPPS2             SSP2CLKPPSbits.SSP2CLKPPS2      // bit 2
#define SSP2CLKPPS3             SSP2CLKPPSbits.SSP2CLKPPS3      // bit 3
#define SSP2CLKPPS4             SSP2CLKPPSbits.SSP2CLKPPS4      // bit 4

#define SSP2DATPPS0             SSP2DATPPSbits.SSP2DATPPS0      // bit 0
#define SSP2DATPPS1             SSP2DATPPSbits.SSP2DATPPS1      // bit 1
#define SSP2DATPPS2             SSP2DATPPSbits.SSP2DATPPS2      // bit 2
#define SSP2DATPPS3             SSP2DATPPSbits.SSP2DATPPS3      // bit 3
#define SSP2DATPPS4             SSP2DATPPSbits.SSP2DATPPS4      // bit 4

#define SSP2SSPPS0              SSP2SSPPSbits.SSP2SSPPS0        // bit 0
#define SSP2SSPPS1              SSP2SSPPSbits.SSP2SSPPS1        // bit 1
#define SSP2SSPPS2              SSP2SSPPSbits.SSP2SSPPS2        // bit 2
#define SSP2SSPPS3              SSP2SSPPSbits.SSP2SSPPS3        // bit 3
#define SSP2SSPPS4              SSP2SSPPSbits.SSP2SSPPS4        // bit 4

