OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18875.h
#define C                       STATUSbits.C                    // bit 0
#define DC                      STATUSbits.DC                   // bit 1
#define Z                       STATUSbits.Z                    // bit 2
#define NOT_PD                  STATUSbits.NOT_PD               // bit 3
#define NOT_TO                  STATUSbits.NOT_TO               // bit 4

#define C_SHAD                  STATUS_SHADbits.C_SHAD          // bit 0
#define DC_SHAD                 STATUS_SHADbits.DC_SHAD         // bit 1
#define Z_SHAD                  STATUS_SHADbits.Z_SHAD          // bit 2

#define T0CKIPPS0               T0CKIPPSbits.T0CKIPPS0          // bit 0
#define T0CKIPPS1               T0CKIPPSbits.T0CKIPPS1          // bit 1
#define T0CKIPPS2               T0CKIPPSbits.T0CKIPPS2          // bit 2
#define T0CKIPPS3               T0CKIPPSbits.T0CKIPPS3          // bit 3

#define T0OUTPS0                T0CON0bits.T0OUTPS0             // bit 0
#define T0OUTPS1                T0CON0bits.T0OUTPS1             // bit 1
#define T0OUTPS2                T0CON0bits.T0OUTPS2             // bit 2
#define T0OUTPS3                T0CON0bits.T0OUTPS3             // bit 3
#define T016BIT                 T0CON0bits.T016BIT              // bit 4
#define T0OUT                   T0CON0bits.T0OUT                // bit 5
#define T0EN                    T0CON0bits.T0EN                 // bit 7

#define T0CKPS0                 T0CON1bits.T0CKPS0              // bit 0, shadows bit in T0CON1bits
#define T0PS0                   T0CON1bits.T0PS0                // bit 0, shadows bit in T0CON1bits
#define T0CKPS1                 T0CON1bits.T0CKPS1              // bit 1, shadows bit in T0CON1bits
#define T0PS1                   T0CON1bits.T0PS1                // bit 1, shadows bit in T0CON1bits
#define T0CKPS2                 T0CON1bits.T0CKPS2              // bit 2, shadows bit in T0CON1bits
#define T0PS2                   T0CON1bits.T0PS2                // bit 2, shadows bit in T0CON1bits
#define T0CKPS3                 T0CON1bits.T0CKPS3              // bit 3, shadows bit in T0CON1bits
#define T0PS3                   T0CON1bits.T0PS3                // bit 3, shadows bit in T0CON1bits
#define T0ASYNC                 T0CON1bits.T0ASYNC              // bit 4
#define T0CS0                   T0CON1bits.T0CS0                // bit 5
#define T0CS1                   T0CON1bits.T0CS1                // bit 6
#define T0CS2                   T0CON1bits.T0CS2                // bit 7

#define T1CKIPPS0               T1CKIPPSbits.T1CKIPPS0          // bit 0
#define T1CKIPPS1               T1CKIPPSbits.T1CKIPPS1          // bit 1
#define T1CKIPPS2               T1CKIPPSbits.T1CKIPPS2          // bit 2
#define T1CKIPPS3               T1CKIPPSbits.T1CKIPPS3          // bit 3
#define T1CKIPPS4               T1CKIPPSbits.T1CKIPPS4          // bit 4

#define T1CS0                   T1CLKbits.T1CS0                 // bit 0, shadows bit in T1CLKbits
#define CS0                     T1CLKbits.CS0                   // bit 0, shadows bit in T1CLKbits
#define T1CS1                   T1CLKbits.T1CS1                 // bit 1, shadows bit in T1CLKbits
#define CS1                     T1CLKbits.CS1                   // bit 1, shadows bit in T1CLKbits
#define T1CS2                   T1CLKbits.T1CS2                 // bit 2, shadows bit in T1CLKbits
#define CS2                     T1CLKbits.CS2                   // bit 2, shadows bit in T1CLKbits
#define T1CS3                   T1CLKbits.T1CS3                 // bit 3, shadows bit in T1CLKbits
#define CS3                     T1CLKbits.CS3                   // bit 3, shadows bit in T1CLKbits

#define GSS0                    T1GATEbits.GSS0                 // bit 0, shadows bit in T1GATEbits
#define T1GSS0                  T1GATEbits.T1GSS0               // bit 0, shadows bit in T1GATEbits
#define GSS1                    T1GATEbits.GSS1                 // bit 1, shadows bit in T1GATEbits
#define T1GSS1                  T1GATEbits.T1GSS1               // bit 1, shadows bit in T1GATEbits
#define GSS2                    T1GATEbits.GSS2                 // bit 2, shadows bit in T1GATEbits
#define T1GSS2                  T1GATEbits.T1GSS2               // bit 2, shadows bit in T1GATEbits
#define GSS3                    T1GATEbits.GSS3                 // bit 3, shadows bit in T1GATEbits
#define T1GSS3                  T1GATEbits.T1GSS3               // bit 3, shadows bit in T1GATEbits
#define GSS4                    T1GATEbits.GSS4                 // bit 4, shadows bit in T1GATEbits
#define T1GSS4                  T1GATEbits.T1GSS4               // bit 4, shadows bit in T1GATEbits

#define T1GPPS0                 T1GPPSbits.T1GPPS0              // bit 0
#define T1GPPS1                 T1GPPSbits.T1GPPS1              // bit 1
#define T1GPPS2                 T1GPPSbits.T1GPPS2              // bit 2
#define T1GPPS3                 T1GPPSbits.T1GPPS3              // bit 3
#define T1GPPS4                 T1GPPSbits.T1GPPS4              // bit 4

#define T2AINPPS0               T2AINPPSbits.T2AINPPS0          // bit 0
#define T2AINPPS1               T2AINPPSbits.T2AINPPS1          // bit 1
#define T2AINPPS2               T2AINPPSbits.T2AINPPS2          // bit 2
#define T2AINPPS3               T2AINPPSbits.T2AINPPS3          // bit 3
#define T2AINPPS4               T2AINPPSbits.T2AINPPS4          // bit 4

#define T2CS0                   T2CLKCONbits.T2CS0              // bit 0
#define T2CS1                   T2CLKCONbits.T2CS1              // bit 1
#define T2CS2                   T2CLKCONbits.T2CS2              // bit 2
#define T2CS3                   T2CLKCONbits.T2CS3              // bit 3

#define RSEL0                   T2RSTbits.RSEL0                 // bit 0, shadows bit in T2RSTbits
#define T2RSEL0                 T2RSTbits.T2RSEL0               // bit 0, shadows bit in T2RSTbits
#define RSEL1                   T2RSTbits.RSEL1                 // bit 1, shadows bit in T2RSTbits
#define T2RSEL1                 T2RSTbits.T2RSEL1               // bit 1, shadows bit in T2RSTbits
#define RSEL2                   T2RSTbits.RSEL2                 // bit 2, shadows bit in T2RSTbits
#define T2RSEL2                 T2RSTbits.T2RSEL2               // bit 2, shadows bit in T2RSTbits
#define RSEL3                   T2RSTbits.RSEL3                 // bit 3, shadows bit in T2RSTbits
#define T2RSEL3                 T2RSTbits.T2RSEL3               // bit 3, shadows bit in T2RSTbits
#define RSEL4                   T2RSTbits.RSEL4                 // bit 4, shadows bit in T2RSTbits
#define T2RSEL4                 T2RSTbits.T2RSEL4               // bit 4, shadows bit in T2RSTbits

#define T3CKIPPS0               T3CKIPPSbits.T3CKIPPS0          // bit 0
#define T3CKIPPS1               T3CKIPPSbits.T3CKIPPS1          // bit 1
#define T3CKIPPS2               T3CKIPPSbits.T3CKIPPS2          // bit 2
#define T3CKIPPS3               T3CKIPPSbits.T3CKIPPS3          // bit 3
#define T3CKIPPS4               T3CKIPPSbits.T3CKIPPS4          // bit 4

#define T3GPPS0                 T3GPPSbits.T3GPPS0              // bit 0
#define T3GPPS1                 T3GPPSbits.T3GPPS1              // bit 1
#define T3GPPS2                 T3GPPSbits.T3GPPS2              // bit 2
#define T3GPPS3                 T3GPPSbits.T3GPPS3              // bit 3
#define T3GPPS4                 T3GPPSbits.T3GPPS4              // bit 4

#define T4AINPPS0               T4AINPPSbits.T4AINPPS0          // bit 0
#define T4AINPPS1               T4AINPPSbits.T4AINPPS1          // bit 1
#define T4AINPPS2               T4AINPPSbits.T4AINPPS2          // bit 2
#define T4AINPPS3               T4AINPPSbits.T4AINPPS3          // bit 3
#define T4AINPPS4               T4AINPPSbits.T4AINPPS4          // bit 4

#define T4CS0                   T4CLKCONbits.T4CS0              // bit 0
#define T4CS1                   T4CLKCONbits.T4CS1              // bit 1
#define T4CS2                   T4CLKCONbits.T4CS2              // bit 2
#define T4CS3                   T4CLKCONbits.T4CS3              // bit 3

#define T5CKIPPS0               T5CKIPPSbits.T5CKIPPS0          // bit 0
#define T5CKIPPS1               T5CKIPPSbits.T5CKIPPS1          // bit 1
#define T5CKIPPS2               T5CKIPPSbits.T5CKIPPS2          // bit 2
#define T5CKIPPS3               T5CKIPPSbits.T5CKIPPS3          // bit 3
#define T5CKIPPS4               T5CKIPPSbits.T5CKIPPS4          // bit 4

#define T5GPPS0                 T5GPPSbits.T5GPPS0              // bit 0
#define T5GPPS1                 T5GPPSbits.T5GPPS1              // bit 1
#define T5GPPS2                 T5GPPSbits.T5GPPS2              // bit 2
#define T5GPPS3                 T5GPPSbits.T5GPPS3              // bit 3
#define T5GPPS4                 T5GPPSbits.T5GPPS4              // bit 4

#define T6AINPPS0               T6AINPPSbits.T6AINPPS0          // bit 0
#define T6AINPPS1               T6AINPPSbits.T6AINPPS1          // bit 1
#define T6AINPPS2               T6AINPPSbits.T6AINPPS2          // bit 2
#define T6AINPPS3               T6AINPPSbits.T6AINPPS3          // bit 3
#define T6AINPPS4               T6AINPPSbits.T6AINPPS4          // bit 4

